In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('summer.csv')

In [3]:
df.shape

(31165, 9)

In [4]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [6]:
pd.value_counts(df['City']).head()

London         3567
Athens         2149
Los Angeles    2074
Beijing        2042
Sydney         2015
Name: City, dtype: int64

In [21]:
df['Athlete'] = df['Athlete'].str.split(', ').str[::-1].str.join(" ").str.title()

In [22]:
male_df = df[df['Gender'] == 'Men']
female_df = df[df['Gender'] == 'Women']

In [23]:
male_df.shape

(22746, 9)

In [24]:
female_df.shape

(8419, 9)

In [25]:
pd.value_counts(male_df['Athlete']).head()

Michael Phelps         22
Nikolay Andrianov      15
Boris Shakhlin         13
Edoardo Mangiarotti    13
Takashi Ono            13
Name: Athlete, dtype: int64

In [26]:
pd.value_counts(female_df['Athlete']).head()

Larisa Latynina     18
Jenny Thompson      12
Birgit Fischer      12
Dara Torres         12
Natalie Coughlin    12
Name: Athlete, dtype: int64

In [36]:
male_df_2 = male_df.groupby(['Athlete','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending=False)

In [37]:
male_df_2.head()

              Athlete Medal  Sport
12806  Michael Phelps  Gold     18
2675       Carl Lewis  Gold      9
12271      Mark Spitz  Gold      9
14059     Paavo Nurmi  Gold      9
16242      Sawao Kato  Gold      8

In [38]:
male_df_2.drop_duplicates('Medal')

                  Athlete   Medal  Sport
12806      Michael Phelps    Gold     18
773          Alexei Nemov  Bronze      6
507    Aleksandr Dityatin  Silver      6

In [42]:
df_medals = df.groupby(['Country','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending=False)

In [43]:
df_medals.head()

    Country   Medal  Sport
327     USA    Gold   2235
328     USA  Silver   1252
326     USA  Bronze   1098
321     URS    Gold    838
322     URS  Silver    627

In [47]:
pivot_table = pd.pivot_table(df_medals, values='Sport', columns='Medal', index='Country').fillna(0)

In [48]:
pivot_table.head()

Medal    Bronze  Gold  Silver
Country
AFG         2.0   0.0     0.0
AHO         0.0   0.0     1.0
ALG         8.0   5.0     2.0
ANZ         5.0  20.0     4.0
ARG        91.0  69.0    99.0

In [50]:
pivot_table.sort_values('Gold', ascending=False).head()

Medal    Bronze    Gold  Silver
Country
USA      1098.0  2235.0  1252.0
URS       584.0   838.0   627.0
GBR       553.0   546.0   621.0
ITA       404.0   476.0   416.0
GER       475.0   452.0   378.0